{"Estonian":{"title":"🇪🇪 Estonian cheat sheet","links":[],"tags":["languages","estonia"],"content":"Greetings &amp; Goodbyes §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENhommikmorningpäevdayõhtueveningöönightkullakehoneytere / tervisthellotšaubyenohwell\n\nTere  (hommikust / päevast / õhtust)! - Good (morning / afternoon / evening)!\nHead aega - Goodbye\nNägemiseni siis - See you then\nNägemist - See you\nKõike head - All the best\nKuulmiseni - I’ll be hearing from you\nHomseni - Until tomorrow\nHead õhtut - Have a good evening\nHead ööd - Have a good night\nKohtumiseni - Until we see\n\nNumbers,  Weekdays &amp; Time §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nENET0null1üks2kaks3kolm4neli5viis6kuus7seitse8kaheksa9üheksa10kümme11üksteist12kaksteist\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENesmaspäevMondayteisipäevTuesdaykolmapäevWednesdayneljapäevThursdayreedeFridaylaupäevSaturdaypühapäevSunday\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENveerandquarter pastkolmveerandthree quartersjubaalready\n\nEsmaspäevani - Until monday\nMis kell on? - What’s the time?\nKell on 1 - It’s 1 o’clock\nKui palju kell on? - What time is it?\nKell on pool seitse - I’ts half past six\nÜks hetk - One moment\nMa kohe vaatan - I’ll have a look\nAppi - Oh dear\n\nPronouns §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENmina / maIsina / sayou (informal)teie / teyou (formal)tema / tahe/shemeie / meweteie / teyounemad / nadthey\nRequests §\n\nÜtleme sina - Let’s use informal you\nTule palung siia - Please come here\nHelista siis mulle, palun - Please call me then\nJoo veel kohvi - Drink more coffee\nPalun ära tee niimodi - Please don’t do that\nIstu palun - Sit, please\nKuhu ma istun? - Where can I sit?\n\nThanks §\n\nAitäh - Thanks\nTänu - I thank you\nSuur aitäh - Big thanks\nSuur suur aitaäh - Thank you very much\nPalun - Please / You are welcome / Here you are\nVabandust - I’m sorry\nVabandage - I’m sorry (formal)\nAnna andeks - Forgive me\nPole midagi/viga - No problem\nPole hullu - Nothing crazy\n\nGetting acquainted §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENprouamrshärramrkaptancaptainklounclownkas …question with answer yes / notõestireallynatukenea little\n\nSaage palun tuttavaks - Get acquainted\nSaame tuttavaks - Let’s get acquainted\nMeeldiv tutvuda - Nice to meet you\nVäga meeldiv - Very pleasant\nSamad sõnad - Same here\nMe pole vist varem kohtunud - We probably have not met before\nMinu nimi on - My name is\nKas ma tohin ennast tutvustada - May I introduce myself?\nKas ma tohin tutvustada … - May I introduce …?\n\nDo you speak … §\n\nKas sa räägid … keelt? - Do you speak …?\nKas sa oskad … keelt? - Do you speak …?\nRäägin küll - Yes, I do\nKahjuks ei oska - Unfortunately, I don’t\nMina ka ei oska - I don’t speak it either\nMa ei saa aru - I don’t understand\nOskan küll - I do indeed\nAga sina? - What about you?\nKui huvitav - How interesting\n\nVerbs §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENsöömato eatjöömato drinkistumato sittulemato comeolemato berääkimato speak\nOlema §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPronounFormminaolensinaoledtemaonmeieolemeteieoletenemadon\nRääkima §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPronounFormmarääginsaräägidtaräägibmeräägimeteräägitenadräägivad\n\nMina ei ole - I am not\nMina pole - I am not\nMa ei … - i don’t …\nÄra … - Don’t …\n\nWhat’s your name? §\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nETENniminameperekonnanimisurnameeesnimiforename\n\nMinu nimi on … - My name is …\nMis su nimi on? - What’s your name?\nKas sinu nimi on …? - Is your name …?\nKuidas teie perekonnanimi on? - What is your surname?\nJa kes teie olete? - And who are you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nENET longET shortmyminumuyoursinusuhis/her/itstemataourmeiemeyourteietetheirnendenende"},"homeserver/Notifications":{"title":"Notifications","links":[],"tags":[],"content":"Push notifications are useful to inform about\n\nserver restarts\nsuccessful backups\npublic IP changes\nupdated docker images\nor any other results or errors in automatically executed scripts and events.\n\nntfy.sh §\nntfy.sh is a nice, self-hostable notification broker, based on publish-subscribe. Its advantages are the possibility of sending and subscribing to different topics, which enables a nice separation for different types of messages and multiple users or clients to subscribe to different topics. Also it comes integrated to many self-hostable applications, making it possible to have them send messages through ntfy. Disadvantages are that for privacy reasons, the instance should be self-hosted, which then means to receive a notification, a client must be permanently connected to the homeserver, which might not be the case, depending on the setup. Also, personally I have experienced notifications not coming through, being delayed or coming through but not appearing on the screen, at least with an Android client.\nA docker-compose could look like this. To be able to subscribe to the server/ some topics, it is useful to add it to a reverse proxy, thus enabling subscriptions to ntfy.myhomeserver.com/someTopic.\nversion: 3&quot;\n \nname: homeserver\n \nservices:\n \n  ntfy:\n    image: binwiederhier/ntfy:latest\n    container_name: ntfy\n    command:\n      - serve\n    volumes:\n      - /homeserver/ntfy/data/cache:/var/cache/ntfy\n      - /homeserver/ntfy/data/etc:/etc/ntfy\n    networks:\n      - proxy-network\n    env_file:\n      - /homeserver/.env\n      - /homeserver/ntfy/.env\n    healthcheck:\n        test: [&quot;CMD-SHELL&quot;, &quot;wget -q --tries=1 http://localhost:80/v1/health -O - | grep -Eo &#039;\\&quot;healthy\\&quot;\\\\s*:\\\\s*true&#039; || exit 1&quot;]\n        interval: 60s\n        timeout: 10s\n        retries: 3\n        start_period: 40s\n    restart: unless-stopped\n \nnetworks:\n  proxy-network:\n    external: true"},"index":{"title":"Home","links":["reading/reviews"],"tags":[],"content":"echo &quot;Hello world!&quot;\nWelcome to my Notes! They are still a work-in-progress.\nThe notes itself are written in Markdown with Obsidian. Then Quartz filters out the public ones and renders them into the static website you are seeing right now. A custom pipeline picks up the latest version of the notes every once in a while, renders them into HTML and autmatically pushes the latest changes to Github, where this static site is hosted. Fancy, right?\nOccasionally I read books and review them."},"reading/reviews/21-Lessons-for-the-21st-Century":{"title":"21 Lessons for the 21st Century","links":[],"tags":[],"content":"The long road ahead of us §\nWe are barely one-quarter into the 21st century and even though there is more than 3/4 to go, almost everyone is aware of at least some of the whole lot of issues that society faced recently and is facing just now. The world has changed rapidly and that change is only accelerating, adding more and more complexity to our lifes. Both external factors, like climate and environment and internal developments like spreading nationalism or upcoming technology will change lifes; not only the lifes of our descendants but of todays population. This can be exciting, scary or confusing, but it concerns all of us. This book names 21 of the most relevant or crucial topics and tries to predict what will change, why it will change and tries to offer not solutions but hints at how we will have to adjust.\nSo do not despair and have a read.\nWe need to rethink §\nBuzzwords like Pandemic, Climate Change, Immigration, Nationalism or Artificial Intelligence dominate the headlines a lot; we are annoyed, irritated, scared, worried or confused. That is partly, as Harari argues in one section, due to questionable biases of the media. But it is also because they are issues that heavily shape our lifes while lying largely out of our control as individuals. His take is that, to avert a societal crisis, we need to form a united and connected world society to tackle the big issues, by rethinking the role of work and income in our lifes, how we interconnect offline and online, how we let religion impact our decision making. How we react to terrorism and how we educate todays children. Reevaluate what unites our cultures, how we govern technology and so much more.\nThe book is divided into five parts with their respective chapters, and concern themselves with The Technological Challenge, The Political Challenge, Despair and Hope, Truth and Resilience. It is therefore very convenient to just read it “lesson by lesson” and in between dwell on the content, since a lot of the topics seem of too grave importance, to just read the book from cover to cover without spending ones own thoughts on the implications of the writings.\nA synthesis §\nYuval Noah Harari is not new to writing; very likely you have heard of one of his other works “Sapiens: A Brief History of Humankind” or “Homo Deus: A Brief History of Tomorrow”, in which he examined the human past and the human future. This book seems very much like a synthesis of those previous works; naturally a lot of concepts or ideas are being reintegrated in his new work and thereby more or less bringing his “trilogy on humans” to conclusion. He seems to speak with very much authority and while I am sure there is loads of valid critism to his ideas, many ring true to me personally.\nThis book is trying to predict and look into the future and therefore is in its very nature not a recital of facts. In the end, history will find its course and I am sure it is not gonna look just like Harari prophesied. But I think he proved with his previous works a fantastic ability to grasp and illustrate the most complex human developments and so this book at least opens up a conversation about what our future might look like. Definitely a recommended read!"},"reading/reviews/Bullshit-Jobs":{"title":"Bullshit Jobs","links":[],"tags":[],"content":"A provocative claim §\nThe first line of this books Wikipedia-page quotes: “Bullshit Jobs: A Theory (…) postulates the existence of meaningless jobs and analyzes their societal harm.”. For me, hearing about this claim, made me immediatly re-evaluate what I experienced in my employments, what I heard of others and what outlook I had on some specific professions. Could it be, that not my missing knowledge and distorted perspective made me think some jobs were entirely useless but that there was actual evidence? I had to give this read.\nGraeber, the anarchist §\nThe author, David Graeber, who is not with us any longer, was professor, anthropologist and interestingly, anarchist. I stumbled upon this information after reading the book halfway and it actually explained a lot, which is why I feel the need to mention this. The book is very provocative, outlining an almost dystopian development of our work-culture until today, resulting in a majority of us doing no useful work at all or maybe “undoing” others work.\nMuch philosophy, some anecdotes, few data §\nGraeber dives (at least for my little experience) deep into historical, political and mostly philosophical backgrounds of what is actually considered “work”, its role in our economy, society and history, whom it is supposed to benefit and what (monitary or not) gains it should yield.\nExpectedly, considering the authors background, there is much philosophical reasoning to be found in the book and few actual evident data (like I would have preferred); nevertheless he gives loads of interesting anecdotical accounts of people of varying profession, shining a light on what is going on behind the curtains of big and prestigious firms or institutions.\nHe is on to something §\nHis initial point is (which rings true for me) that it is paradoxical, how the world society has come so far in automatization of work and efficiency-improvements through fast-paced technological advancements, while it seems as there exists more work to be done than ever and we seem to be far away from a 15-hour-work-week, contradicting all forecasts from the past.\nI think on the premise, that something seems off here, we can all agree.\nI will not spoil the main-points of the book here, but I enjoyed most parts of it, as it opened up very interesting perspectives for me, laid out the widespread, though hidden,phenomenon of useless jobs and sets it in context of societal and cultural developments in our post-industrialized world.\nI may not agree with everything stated in the book, but still recommend giving it a read, as it helps to see things in our work-culture more critical, although they may seem like unchangeable circumstances.\nFurther resources §\n\nDavid Graeber on Wikipedia\nBullshit Jobs on Wikipedia\n"},"reading/reviews/Clean-Code":{"title":"Clean Code","links":[],"tags":[],"content":"The title says it all §\nWhat a book titled Clean Code deals with, is hardly any mystery, no matter your professional background. Its content can quite easily be summed up: the book teaches you, the coder and aspiring or practicing software developer, how you should write code. The book calls the code clean, but what that looks like in detail, you should learn from the master himself, not me.\nThe master himself §\nWhy Robert C. Martin is a master at crafting code, seems to be self-evident; the man is a programmer of the first hour, and therefore has decades of experience writing code, but also providing consultation and training and authoring a bunch of influential book on software development, such as architecture, agile, OOP and more. So, if i am to trust anyones opinion, on what code should look like, it is this guys’.\n“I think I’m pretty good at coding” §\nThat is at least what I thought after having completed the major part of my computer science studies and having worked as a software developer for over a year. Oh boy, was I wrong. Because, as I am aware now, just because code does exactly what it should, without any flaws, it can be far from perfect.\nThe code should be readable, clearly structured, display only expected behaviour, follow consistent naming, etc. Clearly, the code will work just the same, but code is not only read by machines; humans have to read it, too.\nMaybe a good metaphor is: if you can give your code to the new coworker, ask him to change a few things and fly off to the north-pole for 2 months without checking your e-mails and have a good conscience, then your code is “clean”.\nI rest my defence §\nI think I made my case and motivated, why this book is a must-read for every programmer. Of course Martin, or “Uncle Bob”, as he calls himself, reasons way further what goals the design of your code should achieve and how to do that. It truly changed the way I look at (also my old) code now and how I approach any new project. I’m convinced that everyone can learn a few new tricks from the book. Actually, I am quite disappointed that the book was never promoted or mentioned during my studies!\nBut you, the reader, are lucky that you received this recommendation now from me and so I hope the next thing you read after this post is Clean Code by Robert C. Martin!\nFurther resources §\n\nA nice summary of the rules on GitHub\nRobert C. Martin on Wikipedia\nMartin’s website\n"},"reading/reviews/Everybody-Lies":{"title":"Everybody Lies","links":[],"tags":[],"content":"A book for everybody §\nEverybody lies can be read by everyone; this is the good message. The prominent buzzword Big Data can be found everywhere in recent years. And even though by now almost everyone has some vague idea of what it means or what it entails, I am claiming that only a small fraction of people know much about its technicalities or “how things work”.\nDavidowitz doesn’t go much into technical or mathematical details, which means the book is very much accessible to everyone; he does however cite a lot of statistics and throws around numbers, so you should at least not be afraid of percentages. He presents his results and interesting revelations in a very simple and illustrive way and so the books content is not only easily understood but also entertaining and nice to read.\nThe bad message §\nBeing witty, entertaining and accessible is the upside of the book; it however stays on the very general surface of things. It provides very interesting insights in human behaviour, biases and more, a lot of fun facts or interesting anecdotes, but does not go into detail about the scientific background. If you are interested in methodology or explainations of how Data Science works in detail, this book has little to offer. For people with connection to the field it is a short and entertaining read, but will most likely not leave a lasting impression. I would even hesitate to call it “popular science”. However, the book does not claim to be educational or scientific, so I am totally fine with the experience; you still get what the book promises and if the lack of depth makes it readable for people without the fitting background, that seems like a good trade-off.\n“I’m in the prediction business, not the explanation business” §\nThis nice quote is being cited in the book; and it fantastically captures a point Davidowitz makes and warns people that see Data Science as the holy grail. Data Science is a tool and in an economical context it might do literal wonders for us; it does however not explain, prove or reveal causalities, especially in human behaviour, and that is why we have and need psychologists, biologists or doctors. In the book Davidowitz lays out not only limitations of Big Data but also risks, dangers or consequences of errors that we have to consider when dealing with data; he paints a picture of a society that relies on Big Data and the pitfalls we should avoid on our journey into a more than ever digital world.\nOverall the book is a short, entertaining, not too deep, but easy-to-follow read. I recommend it to everyone who is interested in learning more about human behaviour and how Big Data can be used in psychology.\nFurther resources §\n\nSeth Stephens-Davidowitz on Wikipedia\nStephens-Davidowitz’s website\n"},"reading/reviews/Factfulness":{"title":"Factfulness","links":[],"tags":[],"content":"Lets play a little game! §\nInstead of giving a plain recommendation or review of this book, why don’t you try to answer the following three questions without googleing; if you score less than two right answers, skip my review; you will definitely have to read this book!\n\n\nWhere does the majority of the world population live?\n\n Low-income countries\n Middle-income countries\n High-income countries\n\n\n\nWhat is the life expectancy of the world today?\n\n 50 years\n 60 years\n 70 years\n\n\n\nHow many people in the world have some access to electricity?\n\n 20%\n 50%\n 80%\n\n\n\nOur intuition is flawed §\nI will just assume you have answered at least one of the questions wrong. And if I would pose those and similar questions to the general population, they will almost consistently get most of them wrong. This is not my assumption, this is a fact. Hans Rosling shows how we fall victim to a lot of biases, to selective perception of our world and filter-bubbles, which distorts our view on the problems of the world. And he wants to help and show us, how we can overcome these flaws with the help of facts: Factfulness.\nLet’s use our data! §\nFactfulness was a fantastic read; both the narration style and chapter-length, short intermediate summaries and images made it very easy and entertaining. The book deals with data, facts, statistics and projections about the big social issues in the world, such as world hunger, poverty, child mortality, access to education and many more.\nAs far as Rosling got me convinced, even though there is a lot of issues that need to be tackled, we have come a long way and achieved a lot as the world society. And this means we need to continue to work to make things even better, but not in a panicked and desperate effort, but calm, rational and based on the available data, of which we have plenty nowadays.\nOptimism in book form §\nThis is all Factfulness is about and not only does it offer a refreshingly optimistic and realistic perspective on social issues but also gives advice on how we fall for popular misconceptions through media, intuition and natural instincts and how to avoid this and see the world how it is: by using facts, data and research. It is therefore not only providing hard facts but loads of advice how to be more critical towards our biases.\nThis book is only the pinnacle of Roslings effort to better the world and educate non-experts on what the important issues are - and are not. So if you are interested in the topic in general, consider not only reading this book, but also have a look at one of his Ted Talks!\nFurther resources §\n\nHans Rosling on Wikipedia\nGapminder, Roslings non-profit, fighting misinformation\nTED talk given by Rosling\n"}}